tutorials/compressibleVoF/damBreak/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,alpha)  Gauss interfaceCompression vanLeer 1;

    div(rhoPhi,U)   Gauss linearUpwind grad(U);Gauss upwind;

    div(alphaRhoPhi,e) Gauss upwind;
    div(alphaRhoPhi,T) Gauss upwind;

    div(rhoPhi,K)   Gauss upwind;
    div(phi,p)      Gauss upwind;

    div(rhoPhi,k)   Gauss upwind;
    div(rhoPhi,epsilon) Gauss upwind;
    div(rhoPhi,omega)   Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
